vmux0.0.11/ycsbVMs_ycsb_64vms_vmux-med_-1rps_rep0/vm26.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-02-05 03:38:14:259 0 sec: 0 operations; est completion in 0 second 
2025-02-05 03:38:24:069 10 sec: 4981 operations; 498.1 current ops/sec; est completion in 9 days 23 hours [READ: Count=2468, Max=54207, Min=94, Avg=1895.43, 90=7451, 99=12959, 99.9=22767, 99.99=54207] [UPDATE: Count=2524, Max=28687, Min=85, Avg=1989.12, 90=7655, 99=14295, 99.9=20463, 99.99=28687] 
2025-02-05 03:38:34:069 20 sec: 15212 operations; 1023.1 current ops/sec; est completion in 6 days 12 hours [READ: Count=5103, Max=29295, Min=77, Avg=951.98, 90=2653, 99=11175, 99.9=15287, 99.99=16591] [UPDATE: Count=5117, Max=214015, Min=80, Avg=987.75, 90=1929, 99=11167, 99.9=15231, 99.99=209919] 
2025-02-05 03:38:44:069 30 sec: 27930 operations; 1271.8 current ops/sec; est completion in 5 days 8 hours [READ: Count=6416, Max=15983, Min=79, Avg=803.37, 90=1414, 99=9431, 99.9=13143, 99.99=15847] [UPDATE: Count=6302, Max=15823, Min=78, Avg=760.53, 90=895, 99=9231, 99.9=12847, 99.99=15303] 
2025-02-05 03:38:54:069 40 sec: 40228 operations; 1229.8 current ops/sec; est completion in 4 days 22 hours [READ: Count=6182, Max=16319, Min=83, Avg=825.02, 90=1598, 99=9919, 99.9=13895, 99.99=15543] [UPDATE: Count=6116, Max=16255, Min=79, Avg=794.36, 90=673, 99=10575, 99.9=15351, 99.99=16127] 
2025-02-05 03:39:04:069 50 sec: 53723 operations; 1349.5 current ops/sec; est completion in 4 days 15 hours [READ: Count=6709, Max=209919, Min=82, Avg=756.96, 90=406, 99=9135, 99.9=13823, 99.99=17135] [UPDATE: Count=6786, Max=207359, Min=78, Avg=719.34, 90=371, 99=9071, 99.9=12367, 99.99=204799] 
2025-02-05 03:39:14:069 60 sec: 66123 operations; 1240 current ops/sec; est completion in 4 days 12 hours [READ: Count=6213, Max=19279, Min=79, Avg=796.87, 90=785, 99=10351, 99.9=14007, 99.99=16159] [UPDATE: Count=6187, Max=16047, Min=79, Avg=809.21, 90=672, 99=10607, 99.9=14135, 99.99=16031] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-02-05 03:39:15:078 61 sec: 68117 operations; 1976.21 current ops/sec; est completion in 4 days 10 hours [READ: Count=1011, Max=12191, Min=79, Avg=496.79, 90=221, 99=8199, 99.9=11407, 99.99=12191] [CLEANUP: Count=1, Max=2269, Min=2268, Avg=2269, 90=2269, 99=2269, 99.9=2269, 99.99=2269] [UPDATE: Count=983, Max=11399, Min=83, Avg=510.8, 90=229, 99=8171, 99.9=10143, 99.99=11399] 
[OVERALL], RunTime(ms), 61014
[OVERALL], Throughput(ops/sec), 1116.4159045464976
[TOTAL_GCS_Copy], Count, 6
[TOTAL_GC_TIME_Copy], Time(ms), 18
[TOTAL_GC_TIME_%_Copy], Time(%), 0.029501425902251945
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.029501425902251945
[READ], Operations, 34102
[READ], AverageLatency(us), 889.1622485484722
[READ], MinLatency(us), 77
[READ], MaxLatency(us), 209919
[READ], 95thPercentileLatency(us), 7379
[READ], 99thPercentileLatency(us), 10623
[READ], Return=OK, 34102
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2269.0
[CLEANUP], MinLatency(us), 2268
[CLEANUP], MaxLatency(us), 2269
[CLEANUP], 95thPercentileLatency(us), 2269
[CLEANUP], 99thPercentileLatency(us), 2269
[UPDATE], Operations, 34015
[UPDATE], AverageLatency(us), 885.3788328678525
[UPDATE], MinLatency(us), 78
[UPDATE], MaxLatency(us), 214015
[UPDATE], 95thPercentileLatency(us), 7279
[UPDATE], 99thPercentileLatency(us), 10975
[UPDATE], Return=OK, 34015
AUTOTEST_DONE